Revit 2027 API
UnitTypeId.Gigajoules Property
 Gigajoules.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId Gigajoules { get; }
Public Shared ReadOnly Property Gigajoules As ForgeTypeId
	Get
public:
static property ForgeTypeId^ Gigajoules {
	ForgeTypeId^ get ();
}
static member Gigajoules : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
UnitTypeId Class
Autodesk.Revit.DB Namespace